In [4]:
import pandas as pd

In [5]:
import numpy as np

In [4]:
l=['a','b','c']
dt=[1,2,3]
d={'a':1,'b':2,'c':3}

In [6]:
pd.Series(data=dt)

0    1
1    2
2    3
dtype: int64

In [7]:
pd.Series(data=dt,index=l)

a    1
b    2
c    3
dtype: int64

In [8]:
pd.Series(data=l,index=dt)

1    a
2    b
3    c
dtype: object

In [9]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [10]:
sr1=pd.Series([1,2,3,4],['usa','ussr','italy','japan'])

In [11]:
sr2=pd.Series([1,2,5,4],['usa','ussr','mikk','japan'])

In [12]:
sr1

usa      1
ussr     2
italy    3
japan    4
dtype: int64

In [13]:
sr2

usa      1
ussr     2
mikk     5
japan    4
dtype: int64

In [14]:
sr1 + sr2

italy    NaN
japan    8.0
mikk     NaN
usa      2.0
ussr     4.0
dtype: float64

In [48]:
np.random.seed(101)

In [113]:
from numpy.random import randn

In [114]:
df = pd.DataFrame(randn(), ['A','B','C','D'],['W','X','Y','Z'])

In [115]:
df

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652

In [124]:
df['W']

A    1.996652
B    1.996652
C    1.996652
D    1.996652
Name: W, dtype: float64

In [131]:
df['new']=df['W'] + df['X']

In [132]:
df

          W         X         Y         Z       new
A  1.996652  1.996652  1.996652  1.996652  3.993305
B  1.996652  1.996652  1.996652  1.996652  3.993305
C  1.996652  1.996652  1.996652  1.996652  3.993305
D  1.996652  1.996652  1.996652  1.996652  3.993305

In [133]:
df.drop('new',axis=1,inplace=True)

In [134]:
df

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652

In [135]:
df.loc['A']

W    1.996652
X    1.996652
Y    1.996652
Z    1.996652
Name: A, dtype: float64

In [136]:
df.loc['A','Y']

1.9966522853695665

In [137]:
df > 0

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True

In [138]:
booldf = df >0
df[booldf]

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652

In [116]:
bl=df > 0
r = df[bl]
mycol = ['Y','X']
r[mycol]

          Y         X
A  1.996652  1.996652
B  1.996652  1.996652
C  1.996652  1.996652
D  1.996652  1.996652

In [141]:
df[df['W']>0]

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652

In [145]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  1.996652  1.996652  1.996652  1.996652
B  1.996652  1.996652  1.996652  1.996652
C  1.996652  1.996652  1.996652  1.996652
D  1.996652  1.996652  1.996652  1.996652